#+LATEX_CLASS: dnd
#+STARTUP: content showstars indent
#+OPTIONS: tags:nil
#+TITLE: Carl's Character Sheet
#+FILETAGS: avadra gahdouh character sheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[1c3c049e4d86c2e502806fb07cf9eabe00c05991]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=18
  #+CONSTANTS: DEX=13
  #+CONSTANTS: CON=18
  #+CONSTANTS: INT=9
  #+CONSTANTS: WIS=13
  #+CONSTANTS: CHA=9
  #+CONSTANTS: PROF=3
  :end:
  
* Traits
| Level | Race  | Subrace | Class    | Subclass          | Alignment | Size   |
|-------+-------+---------+----------+-------------------+-----------+--------|
|     9 | Human |         | Pugilist | The sweet science | Neutral   | Medium |

* Stats  
| Speed      | AC | Hit Points    | Saves | Inspo | Hit dice | Exhaustion |
|------------+----+---------------+-------+-------+----------+------------|
| 30 ft Walk | 16 | Pugilist (d8) |       |       | 9/9      |            |
| 15 ft Swim |    |               |       |       |          |            |
|            |    |               |       |       |          |            |
| Total:     |    | 84/84         |       |       |          |            |

* Abilities and Skills
#+name: stats
| Ability | Score | Mod | PB | Roll      | Skill           |
|---------+-------+-----+----+-----------+-----------------|
| STR     |    18 |   4 | X  | 1d20 + 7  | Saving Throw    |
|         |       |     | X  | 1d20 + 7  | Athletics       |
|---------+-------+-----+----+-----------+-----------------|
| DEX     |    13 |   1 | X  | 1d20 + 4  | Saving Throw    |
|         |       |     |    | 1d20 + 1  | Acrobatics      |
|         |       |     |    | 1d20 + 1  | Sleight of Hand |
|         |       |     |    | 1d20 + 1  | Stealth         |
|---------+-------+-----+----+-----------+-----------------|
| CON     |    18 |   4 | X  | 1d20 + 7  | Saving Throw    |
|---------+-------+-----+----+-----------+-----------------|
| INT     |     9 |  -1 |    | 1d20 + -1 | Saving Throw    |
|         |       |     |    | 1d20 + -1 | Arcana          |
|         |       |     |    | 1d20 + -1 | History         |
|         |       |     |    | 1d20 + -1 | Investigation   |
|         |       |     |    | 1d20 + -1 | Nature          |
|         |       |     |    | 1d20 + -1 | Religion        |
|---------+-------+-----+----+-----------+-----------------|
| WIS     |    13 |   1 |    | 1d20 + 1  | Saving Throw    |
|         |       |     |    | 1d20 + 1  | Animal Handling |
|         |       |     |    | 1d20 + 1  | Insight         |
|         |       |     |    | 1d20 + 1  | Medicine        |
|         |       |     | X  | 1d20 + 4  | Perception      |
|         |       |     |    | 1d20 + 1  | Survival        |
|---------+-------+-----+----+-----------+-----------------|
| CHA     |     9 |  -1 |    | 1d20 + -1 | Saving Throw    |
|         |       |     |    | 1d20 + -1 | Deception       |
|         |       |     |    | 1d20 + -1 | Intimidation    |
|         |       |     |    | 1d20 + -1 | Performance     |
|         |       |     |    | 1d20 + -1 | Persuasion      |
|---------+-------+-----+----+-----------+-----------------|
| PROF    |     3 |     |    |           |                 |
#+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
#+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
#+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
#+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
#+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
#+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))

* Resistances


* Immunities


* Attacks
Un armed strikes get a +1 for the next 24 hours

#+NAME: attacks
| Weapon         | Ability | Prof | Type        | Die | Mod To Hit | Roll    |
|----------------+---------+------+-------------+-----+------------+---------|
| Unarmed Strike | STR     | X    | Bludgeoning | 1d8 |          7 | 1d8 + 4 |
| Spiked         | STR     | X    | Bludgeoning | 1d8 |          7 | 1d8 + 4 |
#+TBLFM: $6='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
#+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))

* Proficiencies
| Languages | Tools | Armor | Weapons       |
|-----------+-------+-------+---------------|
| Common    |       | Light | Simple        |
|           |       |       | Improvised    |
|           |       |       | Whip          |
|           |       |       | Hand Crossbow |
|           |       |       |               |

* Equipment
| Name               | Quantity | Cost (gp) | Weight (lbs) | Capacity | Total Weight (lbs) | Total Cost (gp) |
|--------------------+----------+-----------+--------------+----------+--------------------+-----------------|
| Spiked Gauntlet    |        1 |           |              |          | #ERROR             |               0 |
| Boxers with Hearts |        1 |           |              |          | #ERROR             |               0 |
| Troll Shirt        |        1 |           |              |          | #ERROR             |               0 |
| Cloak With Ears    |        1 |           |              |          | #ERROR             |               0 |
|--------------------+----------+-----------+--------------+----------+--------------------+-----------------|
| Carry Capacity     |      200 |           |              |          | #ERROR             |               0 |
#+TBLFM: $6=($ * $4)
#+TBLFM: $7=($2 * $3)
#+TBLFM: @8$6=vsum(@INVALID$6..@20$6)
#+TBLFM: @8$7=vsum(@INVALID$7..@13$7)
#+TBLFM: @8$2=($STR * 10)

** Attunements



** Money
| Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
|--------+--------+----------+------+----------+--------------|
|      0 |      0 |        0 |  600 |        0 |          600 |
#+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10))
   
